# Created 2023-11-14 Tue 22:17
#+title: 
#+author: mb
* Section about =J.S. Bach=

* Section about =W.A. Mozart=

* Section about =11=
#+begin_src elisp

   (defun level1-headlines-filter ()
    (setq headline (org-entry-get nil "ITEM"))
    (setq allHeadlines (list headline) )    
    )

  (setq level1-headlines (org-map-entries #'level1-headlines-filter "LEVEL=1") )

  (defun my-export ()
    (while level1-headlines
      (setq tytul (nth 0 (car level1-headlines)) )
      (print (concat "\n- " tytul  ))
      (print (concat "\n- " tytul  ))

      (setq level1-headlines (cdr level1-headlines)))
    (print "\n " )
    )


  (print level1-headlines)
  (my-export)
#+end_src

#+results: 
#+begin_example

  (("Section about {{{results(=J.S. Bach=)}}}") ("Section about {{{results(=W.A. Mozart=)}}}") ("Section about {{{results(=11=)}}}"))

  "
  - Section about {{{results(=J.S. Bach=)}}}"

  "
  - Section about {{{results(=J.S. Bach=)}}}"

  "
  - Section about {{{results(=W.A. Mozart=)}}}"

  "
  - Section about {{{results(=W.A. Mozart=)}}}"

  "
  - Section about {{{results(=11=)}}}"

  "
  - Section about {{{results(=11=)}}}"

  "
   "
#+end_example
